package CH02;

public class C02음수 {

	public static void main(String[] args) {
//		byte a = (byte)-129;
//		
//		System.out.println(a);
		//컴퓨터(cpu)는 가상회로에 의해 덧셈처리를 할수 있다(0)
		//컴퓨터(cpu)는 뺄셈 처리를 할수 있다(x)
		//실제로 뺼셈의 결과를 가져오는 이유는 보수개념을 도입했기때문이다
		
		// 7 - 4 = 3
		// 7 + 6 = 3
		// 75-18=57
		// 75+82=57
		
		//문제
		//음수값임을 고려하여 풉니다
		//10 진수  ->  2진수
		//111      ->  01101111    
		//-111     ->  10010001 
		//96       ->  128 64  32  16  8  4  2  1    
		//				0  1   1    0   0  0  0  0 
		//-96      ->   1  0   1    0   0  0  0  0  
		//31       ->   0  0   0    1   1  1  1  1
		//-31      ->  	1  1   1    0   0  0  0  1
		
		//2진수      ->    10진수
		//1010111   ->   167
		//00110101  ->   
		//11001100  ->   
		//10101010  ->   
		
		System.out.println((byte)0b1010111);
	}

}
